{"title":"CI/CD for Capacitor Apps","description":"Adding Mobile CI/CD to your Capacitor App development process","url":"/docs/guides/ci-cd","contributors":["mlynch"],"lastUpdated":"2020-07-21T17:17:50Z","headings":[{"id":"ci-cd-for-capacitor-apps","level":1,"text":"CI/CD for Capacitor Apps"},{"id":"basic-ci-cd-for-your-frontend","level":2,"text":"Basic CI/CD for your frontend"},{"id":"adding-mobile-ci-cd","level":2,"text":"Adding Mobile CI/CD"},{"id":"appflow-mobile-ci-cd-for-capacitor-apps","level":2,"text":"Appflow: Mobile CI/CD for Capacitor apps"},{"id":"using-a-traditional-ci-cd-service-with-appflow","level":2,"text":"Using a traditional CI/CD service with Appflow"},{"id":"other-mobile-ci-cd-options","level":2,"text":"Other Mobile CI/CD Options"}],"srcPath":"./docs-md/guides/ci-cd.md","content":"\n<h1 id=\"ci-cd-for-capacitor-apps\">\n  \n  CI/CD for Capacitor Apps\n  \n</h1>\n<p>Every serious app will utilize a CI/CD process for continuous testing, integration, and delivery.</p>\n<p>Unfortunately, Mobile presents unique CI/CD challenges, and the same techniques that web developers use for frontend CI/CD won&#39;t apply for mobile, since build and deployment processes are radically different.</p>\n\n<h2 id=\"basic-ci-cd-for-your-frontend\">\n  <a class=\"heading-link\" href=\"#basic-ci-cd-for-your-frontend\"><ion-icon name=\"link\"></ion-icon>\n  Basic CI/CD for your frontend\n  </a>\n</h2>\n<p>The first step for CI/CD for a Capacitor app is using a process for building and testing your <em>frontend</em> JS app.</p>\n<p>This is commonly done today using a generic CI/CD service like GitHub Actions, CircleCI, Jenkins, etc.</p>\n<p>In this process, an app is set to build on each commit and often run a local test suite. This is the typical JS CI/CD process and your team is likely already familiar with it.</p>\n<p>But this is just the tip of the iceberg, as teams will need to figure out how to build, test, and deploy the actual native mobile side of their app.</p>\n\n<h2 id=\"adding-mobile-ci-cd\">\n  <a class=\"heading-link\" href=\"#adding-mobile-ci-cd\"><ion-icon name=\"link\"></ion-icon>\n  Adding Mobile CI/CD\n  </a>\n</h2>\n<p>Just building and running JS app tests is not nearly enough for a mobile app, given that a big portion of your app needs to build and run as a native iOS and Android app.</p>\n<p>Additionally, the way a mobile app is deployed and updated is very different from a web app. Whereas a web app will be hosted on a server that can be quickly updated, mobile apps are &quot;hosted&quot; in app stores and distributed as cryptographically-signed binaries. The update process is very different.</p>\n<p>This means we need a service that can do native mobile builds and tests, and also offer a way to deploy and update our apps in a native mobile appropriate way.</p>\n\n<h2 id=\"appflow-mobile-ci-cd-for-capacitor-apps\">\n  <a class=\"heading-link\" href=\"#appflow-mobile-ci-cd-for-capacitor-apps\"><ion-icon name=\"link\"></ion-icon>\n  Appflow: Mobile CI/CD for Capacitor apps\n  </a>\n</h2>\n<p>One such service that provides end-to-end Mobile CI/CD is <a href=\"https://useappflow.com/\">Appflow</a>, the official Mobile CI/CD and Mobile DevOps platform for Capacitor apps.</p>\n<p>Appflow provides frequently updated, managed iOS and Android build environments. Appflow integrates with popular git services like GitLab, GitHub, and Bitbucket, to support triggering JS and native mobile builds on each commit. Appflow also supports separating builds into different channels for stakeholders, beta testers, and production users.</p>\n<p>For Capacitor developers, Appflow also offers the ability to push real-time updates to apps without app store submission, as long as those updates are at the JS/HTML/CSS layer of an app.</p>\n<p>For more details, see the <a href=\"https://ionicframework.com/docs/appflow\">Appflow Documentation</a>.</p>\n\n<h2 id=\"using-a-traditional-ci-cd-service-with-appflow\">\n  <a class=\"heading-link\" href=\"#using-a-traditional-ci-cd-service-with-appflow\"><ion-icon name=\"link\"></ion-icon>\n  Using a traditional CI/CD service with Appflow\n  </a>\n</h2>\n<p>Appflow can replace a traditional CI/CD service since it performs web/JS builds and native mobile builds. However, it works great with a traditional CI/CD service.</p>\n<p>To use it in this way, use webhooks to send built assets to Appflow on each commit.</p>\n\n<h2 id=\"other-mobile-ci-cd-options\">\n  <a class=\"heading-link\" href=\"#other-mobile-ci-cd-options\"><ion-icon name=\"link\"></ion-icon>\n  Other Mobile CI/CD Options\n  </a>\n</h2>\n<p>There are other services for Mobile CI/CD, though none focused on Capacitor. Some of those options include <a href=\"https://appcenter.ms\">Visual Studio App Center</a>, <a href=\"https://www.bitrise.io/\">Bitrise</a>, and <a href=\"https://www.buddybuild.com/\">Buddybuild</a> (iOS only). Keep in mind none of these services currently provide remote real-time app updates for Capacitor apps.</p>\n"}