{"title":"Deploying Realtime Updates","description":"Update your Capacitor app remotely in realtime even through the app stores","url":"/docs/guides/deploying-updates","contributors":["mlynch"],"lastUpdated":"2020-06-16T02:22:54Z","headings":[{"id":"app-deployment-and-realtime-updates","level":1,"text":"App Deployment and Realtime Updates"},{"id":"automate-app-store-publishing-with-appflow","level":2,"text":"Automate App Store Publishing with Appflow"},{"id":"deploy-realtime-updates-with-appflow","level":2,"text":"Deploy Realtime Updates with Appflow"},{"id":"connect-to-github-bitbucket-and-gitlab","level":2,"text":"Connect to GitHub, Bitbucket, and GitLab"},{"id":"try-appflow-today","level":2,"text":"Try Appflow Today"}],"srcPath":"./docs-md/guides/deploying.md","content":"\n<h1 id=\"app-deployment-and-realtime-updates\">\n  \n  App Deployment and Realtime Updates\n  \n</h1>\n<p>The last mile of app development involves publishing your app to the app stores, as well as keeping it updated over time.</p>\n<p>One of the key advantages to a web (or hybrid) based mobile development approach is the ability to make realtime updates to apps in an app store friendly way, as long as those changes do not require binary updates (aka compiled native functionality).</p>\n<p>Additionally, since most Capacitor developers are targeting both iOS and Android (and web) at the same time, manually publishing app and binary updates to each store can be unnecessarily tedious.</p>\n<p>To make app store publishing and long term app updates easier, Ionic, the company behind Capacitor, offers a powerful Mobile DevOps platform called <a href=\"https://useappflow.com/\">Appflow</a>.</p>\n\n<h2 id=\"automate-app-store-publishing-with-appflow\">\n  <a class=\"heading-link\" href=\"#automate-app-store-publishing-with-appflow\"><ion-icon name=\"link\"></ion-icon>\n  Automate App Store Publishing with Appflow\n  </a>\n</h2>\n<p>Appflow offers several major time saving features for Capacitor developers. One of the most interesting is the ability to publish directly to both the Apple App Store and the Google Play Store. All plans have support for a number of monthly deployments, with expanded limits to support more apps and the ability to fully automate deployments reserved for higher tier plans.</p>\n\n<h2 id=\"deploy-realtime-updates-with-appflow\">\n  <a class=\"heading-link\" href=\"#deploy-realtime-updates-with-appflow\"><ion-icon name=\"link\"></ion-icon>\n  Deploy Realtime Updates with Appflow\n  </a>\n</h2>\n<p>In concert with app store publishing features, developers can deploy realtime app updates throughout the lifetime of their app using Appflow&#39;s live deploy functionality.</p>\n<p>Live deployment works on the principle that Capacitor apps are built largely as web apps with hooks into native functionality. Apple and Google explicitly allow web content updates to apps, so this feature is app store compatible and provides unprecedented agility to mobile app teams.</p>\n\n<h2 id=\"connect-to-github-bitbucket-and-gitlab\">\n  <a class=\"heading-link\" href=\"#connect-to-github-bitbucket-and-gitlab\"><ion-icon name=\"link\"></ion-icon>\n  Connect to GitHub, Bitbucket, and GitLab\n  </a>\n</h2>\n<p>Appflow can connect directly to a GitHub, Bitbucket, or GitLab repo for git-triggered builds and deployments.</p>\n<p>This makes it easy to connect to your existing development workflow to start adding automated app store and real time updates with zero disruption.</p>\n\n<h2 id=\"try-appflow-today\">\n  <a class=\"heading-link\" href=\"#try-appflow-today\"><ion-icon name=\"link\"></ion-icon>\n  Try Appflow Today\n  </a>\n</h2>\n<p>Appflow powers major consumer and enterprise apps with hundreds of millions of users and significant business impact. The Appflow team works closely with many Fortune 500 companies to thousands of small to medium-sized companies.</p>\n<p>And, because the team behind Appflow works closely with the Capacitor team, Appflow is optimized to work best with Capacitor.</p>\n<p>Appflow is free to get started and uses the same Ionic account you may have used in the past. To get started, visit <a href=\"https://useappflow.com/\">useappflow.com</a> or browse the <a href=\"https://ionicframework.com/docs/appflow\">documentation</a> to learn more about how Appflow works.</p>\n"}